stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba65xx.h
/********************  Bit definition for RCC_BDCR2 register  *******************/
#define RCC_BDCR2_LSI2MODE_Pos             (0UL)
#define RCC_BDCR2_LSI2MODE_Msk             (0x7UL << RCC_BDCR2_LSI2MODE_Pos)      /*!< 0x00000007 */
#define RCC_BDCR2_LSI2MODE                 RCC_BDCR2_LSI2MODE_Msk
#define RCC_BDCR2_LSI2MODE_0               (0x1UL << RCC_BDCR2_LSI2MODE_Pos)      /*!< 0x00000001 */
#define RCC_BDCR2_LSI2MODE_1               (0x2UL << RCC_BDCR2_LSI2MODE_Pos)      /*!< 0x00000002 */
#define RCC_BDCR2_LSI2MODE_2               (0x4UL << RCC_BDCR2_LSI2MODE_Pos)      /*!< 0x00000004 */
#define RCC_BDCR2_LSI2CFG_Pos              (4UL)
#define RCC_BDCR2_LSI2CFG_Msk              (0xFUL << RCC_BDCR2_LSI2CFG_Pos)       /*!< 0x000000F0 */
#define RCC_BDCR2_LSI2CFG                  RCC_BDCR2_LSI2CFG_Msk
#define RCC_BDCR2_LSI2CFG_0                (0x1UL << RCC_BDCR2_LSI2CFG_Pos)       /*!< 0x00000010 */
#define RCC_BDCR2_LSI2CFG_1                (0x2UL << RCC_BDCR2_LSI2CFG_Pos)       /*!< 0x00000020 */
#define RCC_BDCR2_LSI2CFG_2                (0x4UL << RCC_BDCR2_LSI2CFG_Pos)       /*!< 0x00000040 */
#define RCC_BDCR2_LSI2CFG_3                (0x8UL << RCC_BDCR2_LSI2CFG_Pos)       /*!< 0x00000080 */

/********************  Bit definition for RCC_SECCFGR register  **************/
#define RCC_SECCFGR_HSISEC_Pos              (0UL)
#define RCC_SECCFGR_HSISEC_Msk              (0x1UL << RCC_SECCFGR_HSISEC_Pos)       /*!< 0x00000001 */
#define RCC_SECCFGR_HSISEC                  RCC_SECCFGR_HSISEC_Msk
#define RCC_SECCFGR_HSESEC_Pos              (1UL)
#define RCC_SECCFGR_HSESEC_Msk              (0x1UL << RCC_SECCFGR_HSESEC_Pos)       /*!< 0x00000002 */
#define RCC_SECCFGR_HSESEC                  RCC_SECCFGR_HSESEC_Msk
#define RCC_SECCFGR_LSISEC_Pos              (3UL)
#define RCC_SECCFGR_LSISEC_Msk              (0x1UL << RCC_SECCFGR_LSISEC_Pos)       /*!< 0x00000008 */
#define RCC_SECCFGR_LSISEC                  RCC_SECCFGR_LSISEC_Msk
#define RCC_SECCFGR_LSESEC_Pos              (4UL)
#define RCC_SECCFGR_LSESEC_Msk              (0x1UL << RCC_SECCFGR_LSESEC_Pos)       /*!< 0x00000010 */
#define RCC_SECCFGR_LSESEC                  RCC_SECCFGR_LSESEC_Msk
#define RCC_SECCFGR_SYSCLKSEC_Pos           (5UL)
#define RCC_SECCFGR_SYSCLKSEC_Msk           (0x1UL << RCC_SECCFGR_SYSCLKSEC_Pos)    /*!< 0x00000020 */
#define RCC_SECCFGR_SYSCLKSEC               RCC_SECCFGR_SYSCLKSEC_Msk
#define RCC_SECCFGR_PRESCSEC_Pos            (6UL)
#define RCC_SECCFGR_PRESCSEC_Msk            (0x1UL << RCC_SECCFGR_PRESCSEC_Pos)     /*!< 0x00000040 */
#define RCC_SECCFGR_PRESCSEC                RCC_SECCFGR_PRESCSEC_Msk
#define RCC_SECCFGR_PLL1SEC_Pos             (7UL)
#define RCC_SECCFGR_PLL1SEC_Msk             (0x1UL << RCC_SECCFGR_PLL1SEC_Pos)      /*!< 0x00000080 */
#define RCC_SECCFGR_PLL1SEC                 RCC_SECCFGR_PLL1SEC_Msk
#define RCC_SECCFGR_RMVFSEC_Pos             (12UL)
#define RCC_SECCFGR_RMVFSEC_Msk             (0x1UL << RCC_SECCFGR_RMVFSEC_Pos)      /*!< 0x00001000 */
#define RCC_SECCFGR_RMVFSEC                 RCC_SECCFGR_RMVFSEC_Msk

/********************  Bit definition for RCC_PRIVCFGR register  **************/
#define RCC_PRIVCFGR_SPRIV_Pos              (0UL)
#define RCC_PRIVCFGR_SPRIV_Msk              (0x1UL << RCC_PRIVCFGR_SPRIV_Pos)       /*!< 0x00000001 */
#define RCC_PRIVCFGR_SPRIV                  RCC_PRIVCFGR_SPRIV_Msk
#define RCC_PRIVCFGR_NSPRIV_Pos             (1UL)
#define RCC_PRIVCFGR_NSPRIV_Msk             (0x1UL << RCC_PRIVCFGR_NSPRIV_Pos)      /*!< 0x00000002 */
#define RCC_PRIVCFGR_NSPRIV                 RCC_PRIVCFGR_NSPRIV_Msk

/********************  Bit definition for RCC_ASCR register  **************/
#define RCC_ASCR_CEN_Pos                    (0UL)
#define RCC_ASCR_CEN                        RCC_ASCR_CEN_Msk
#define RCC_ASCR_CEN_Msk                    (0x1UL << RCC_ASCR_CEN_Pos)             /*!< 0x00000001 */
#define RCC_ASCR_PSC_Pos                    (8UL)
#define RCC_ASCR_PSC_Msk                    (0x7FUL << RCC_ASCR_PSC_Pos)            /*!< 0x00007F00 */
#define RCC_ASCR_PSC                        RCC_ASCR_PSC_Msk
#define RCC_ASCR_CPS_Pos                    (16UL)
#define RCC_ASCR_CPS_Msk                    (0x7FUL << RCC_ASCR_CPS_Pos)            /*!< 0x007F0000 */
#define RCC_ASCR_CPS                        RCC_ASCR_CPS_Msk

/********************  Bit definition for RCC_ASIER register  **************/
#define RCC_ASIER_CAIE_Pos                  (0UL)
#define RCC_ASIER_CAIE_Msk                  (0x1UL << RCC_ASIER_CAIE_Pos)           /*!< 0x00000001 */
#define RCC_ASIER_CAIE                      RCC_ASIER_CAIE_Msk
#define RCC_ASIER_COIE_Pos                  (1UL)
#define RCC_ASIER_COIE_Msk                  (0x1UL << RCC_ASIER_COIE_Pos)           /*!< 0x00000002 */
#define RCC_ASIER_COIE                      RCC_ASIER_COIE_Msk
#define RCC_ASIER_CAEIE_Pos                 (2UL)
#define RCC_ASIER_CAEIE_Msk                 (0x1UL << RCC_ASIER_CAEIE_Pos)          /*!< 0x00000004 */
#define RCC_ASIER_CAEIE                      RCC_ASIER_CAEIE_Msk

/********************  Bit definition for RCC_ASSR register  **************/
#define RCC_ASSR_CAF_Pos                    (0UL)
#define RCC_ASSR_CAF_Msk                    (0x1UL << RCC_ASSR_CAF_Pos)             /*!< 0x00000001 */
#define RCC_ASSR_CAF                        RCC_ASSR_CAF_Msk
#define RCC_ASSR_COF_Pos                    (1UL)
#define RCC_ASSR_COF_Msk                    (0x1UL << RCC_ASSR_COF_Pos)             /*!< 0x00000002 */
#define RCC_ASSR_COF                        RCC_ASSR_COF_Msk
#define RCC_ASSR_CAEF_Pos                   (2UL)
#define RCC_ASSR_CAEF_Msk                   (0x1UL << RCC_ASSR_CAEF_Pos)            /*!< 0x00000004 */
#define RCC_ASSR_CAEF                       RCC_ASSR_CAEF_Msk

/********************  Bit definition for RCC_ASCNTR register  **************/
#define RCC_ASCNTR_CNT_Pos                  (0UL)
#define RCC_ASCNTR_CNT_Msk                  (0xFFFFFUL << RCC_ASCNTR_CNT_Pos)       /*!< 0x000FFFFF */
#define RCC_ASCNTR_CNT                      RCC_ASCNTR_CNT_Msk

/********************  Bit definition for RCC_ASARR register  **************/
#define RCC_ASARR_AR_Pos                    (0UL)
#define RCC_ASARR_AR_Msk                    (0xFFFFFUL << RCC_ASARR_AR_Pos)         /*!< 0x000FFFFF */
#define RCC_ASARR_AR                        RCC_ASARR_AR_Msk

/********************  Bit definition for RCC_ASCAR register  **************/
#define RCC_ASCAR_CA_Pos                    (0UL)
#define RCC_ASCAR_CA_Msk                    (0x7FFFFFFUL << RCC_ASCAR_CA_Pos)       /*!< 0x07FFFFFF */
#define RCC_ASCAR_CA                        RCC_ASCAR_CA_Msk

/********************  Bit definition for RCC_ASCOR register  **************/
#define RCC_ASCOR_CO_Pos                    (0UL)
#define RCC_ASCOR_CO_Msk                    (0xFFFFFUL << RCC_ASCOR_CO_Pos)         /*!< 0x000FFFFF */
#define RCC_ASCOR_CO                        RCC_ASCOR_CO_Msk

